---
kind: enumMember
id: F:Autodesk.Revit.UI.PostableCommand.PAndIDSettings
enum: Autodesk.Revit.UI.PostableCommand
source: html/f6ccdc1b-6ac3-9c49-d0bb-8a7d1877eab0.htm
---
# Autodesk.Revit.UI.PostableCommand.PAndIDSettings

Manage the mappings between elements, such as services and families, between the P&ID drawing and the Revit model.